<?php
/**
 * Created by PhpStorm.
 * User: xuemusi
 * Date: 2019/8/13
 * Time: 18:11
 */

return [

    /***********公共错误， 90000-99999 ***********/
    '90000' => '缺少参数或者参数为空',
    '90001' => '参数不合法',
    '90002' => '邮箱格式不正确',
    '90003' => '系统异常',
    '90004' => '请输入页码',
    '90005' => '保存失败',
    '90006' => '操作对象ID不能为空',
    '90007' => '操作类型不匹配',
    '90008' => '您没有操作权限',
    '90009' => '服务异常',
    '90010' => '非法手机号',
    '90011' => '缺少签名',
    '90012' => '签名不存在',
    '90013' => '无效签名',
    '90014' => '缺少租户代码',
    '90015' => '无效请求类型',
    '90016' => '签名已过期',
    '90017' => 'TOKEN验证失败',
    '90018' => '租户不存在',

    /***  用户权限,10000-11000  ****/
    '10001'=>'您没有租户权限,请联系管理员',
    '10002'=>'您没有操作权限,请联系管理员',

    /*** 用户操作工作流相关， 20000-21000 ***/
    '20001' => '获取需求列表错误',
    '20002' => '状态不在合法范围',
];